//--------------------------------------------------------------------------------------
//  アクションノードAIクラス   ( actionNodeAI.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ACTION_NODE_AI_H_
#define _ACTION_NODE_AI_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "nodeAI.h"
#include "characterAI.h"
#include "enemy.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  アクションノードAIクラスの定義
//--------------------------------------------------------------------------------------
class ActionNodeAI : public NodeAI
{
public:
	ActionNodeAI( std::string name ,						//  コンストラクタ	
				  CharacterAI* characterAI , 
				  LayerAI* parentLayer ,
				  Enemy::STATE actionState ) :					
				  NodeAI( CharacterAI::NODE_TYPE::ACTION ,
						  name , 
						  characterAI , 
						  parentLayer ) ,
				  m_actionState( actionState ){ }				

	void				Run( void ) override;					//  実行
	void				DrawDebug( void ) override;				//  デバッグ描画

private:
	Enemy::STATE		m_actionState;							//  アクションを起こす状態
};

#endif
