//--------------------------------------------------------------------------------------
//  当たり判定  ( camera.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _COLISION_H_
#define _COLISION_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "main.h"
#include "scene.h"
#include "shape.h"

//--------------------------------------------------------------------------------------
//  当たり判定基底クラスの定義
//--------------------------------------------------------------------------------------
class Colision : public Scene
{
public:
	Colision( ){ };										//  コンストラクタ
	virtual ~Colision( ){ };								//  デストラクタ

	virtual bool		HitCheck( const Shape& s1 ,
								  const Shape& s2 ) = 0;	//  当たっているか確認
};

//--------------------------------------------------------------------------------------
//  円と円の当たり判定クラスの定義
//--------------------------------------------------------------------------------------
class CircleAndCircle : public Colision
{
public:
	CircleAndCircle( ){ };									//  コンストラクタ
	virtual ~CircleAndCircle( ){ };							//  デストラクタ

	bool	HitCheck( const Shape& s1 ,					//  当たっているか確認
					  const Shape& s2 );
};

//--------------------------------------------------------------------------------------
//  矩形と矩形の当たり判定クラスの定義
//--------------------------------------------------------------------------------------
class RectAndRect : public Colision
{
public:
	RectAndRect( ){ };										//  コンストラクタ
	virtual ~RectAndRect( ){ };								//  デストラクタ

	bool	HitCheck( const Shape& s1 ,					//  当たっているか確認
					  const Shape& s2 );
};

#endif

