//--------------------------------------------------------------------------------------
//  エネミーステート( ロックオンダッシュ )  ( enemyLockonDash.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_LOCKON_DASH_H_
#define _ENEMY_LOCKON_DASH_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( ロックオンダッシュ ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyLockonDash : public EnemyState
{
public:
	EnemyLockonDash( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

private:
	void						Action( void );					//  アクション

	float						m_speed;
};

#endif
