//--------------------------------------------------------------------------------------
//  エネミーステート( ブレイブ攻撃000 )  ( enemyHPAttack000.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_HP_ATTACK000_H_
#define _ENEMY_HP_ATTACK000_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( ブレイブ攻撃000 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyHPAttack000 : public EnemyState
{
public:
	EnemyHPAttack000( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void							Init( void ) override;			//  初期化
	void							Uninit( void ) override;		//  終了
	void							Update( void ) override;		//  更新
	void							Draw( void ) override;			//  描画

	static EnemyHPAttack000*		Create( void );					//  生成

private:
	void							Action( void );					//  アクション

	bool							m_slashEffekseer;				//  スラッシュエフェクシアが出たかのフラグ
};

#endif
