//--------------------------------------------------------------------------------------
//  エネミーステート( 魔法発動 )  ( enemyMagicActive.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_MAGIC_ACTIVE_H_
#define _ENEMY_MAGIC_ACTIVE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 魔法発動 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyMagicActive : public EnemyState
{
public:
	EnemyMagicActive( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static EnemyMagicActive*	Create( void );					//  生成

private:
};

#endif
