//--------------------------------------------------------------------------------------
//  エネミーステート( ジャンプ )  ( enemyJump.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_JUMP_H_
#define _ENEMY_JUMP_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( ジャンプ ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyJump : public EnemyState
{
public:
	EnemyJump( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyJump*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_jumpPower;					//  ジャンプ力
	int						m_countJump;					//  ジャンプ数
};

#endif
