//--------------------------------------------------------------------------------------
//  エネミーステート( 吹っ飛び )   ( enemyBlow.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyBlow.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyBlow::Init( void )
{
	//  親の初期化
	EnemyState::Init( );

	//  エネミーが持っているエフェクシア全て停止
	GetEnemy( )->StopAllEffekseer( );

	//  吹っ飛び力の取得
	m_blowPower = GetEnemy( )->GetBlowPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyBlow::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyBlow::Update( void )
{
	//  アクション
	Action( );

	//  重力をかける
	AddGravity( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyBlow::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyBlow::Action( void )
{
	//  無敵時間の設定
	GetEnemy( )->SetInvisibleTime( 2 );

	//  速度の減衰
	m_blowPower += ( 0.0f - m_blowPower ) * 0.04f;

	//  吹っ飛び力分の移動
	GetEnemy( )->MovePos( GetEnemy( )->GetBlowVecDirect( ) * m_blowPower );

	//  エネミー方向ベクトルの設定
	D3DXVECTOR3 enemyVecDirect;
	D3DXVec3Normalize( &enemyVecDirect , &( GetEnemy( )->GetPositionAt( ) - GetEnemy( )->GetPos( ) ) );
	GetEnemy( )->SetVecDirect( enemyVecDirect );

	//  注視点の設定
	GetEnemy( )->SetPositionAt( GetEnemy( )->GetPos( ) - GetEnemy( )->GetBlowVecDirect( ) * 5.0f );

	//  アニメーションが終了するか、吹っ飛び力がある程度まで落ちた場合
	if( GetEnemy( )->GetAnimationFinish( ) == true || m_blowPower < 1.0f )
	{
		//  現在の吹っ飛び力の設定
		GetEnemy( )->SetBlowPower( m_blowPower );

		//  受け身の状態に
		GetEnemy( )->SetAnimation( StateAnimator::MOTION_PASSIVE );
		GetEnemy( )->ChangeState( GetEnemy( )->GetEnemyState( Enemy::STATE::PASSIVE ) );
	}
}