//--------------------------------------------------------------------------------------
//  エネミーステート( 魔法準備 )  ( enemyMagicReady.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_MAGIC_READY_H_
#define _ENEMY_MAGIC_READY_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 魔法準備 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyMagicReady : public EnemyState
{
public:
	EnemyMagicReady( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static EnemyMagicReady*	Create( void );					//  生成

private:
	void						Action( void );					//  アクション
};

#endif
