//--------------------------------------------------------------------------------------
//  エネミーステート( ニュートラル )  ( enemyNeutral.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_NEUTRAL_H_
#define _ENEMY_NEUTRAL_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( ニュートラル ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyNeutral : public EnemyState
{
public:
	EnemyNeutral( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;					//  初期化
	void					Uninit( void ) override;				//  終了
	void					Update( void ) override;				//  更新
	void					Draw( void ) override;					//  描画

	static EnemyNeutral*	Create( void );							//  生成

private:
};

#endif

