//--------------------------------------------------------------------------------------
//  エネミーステート( 受け身 )  ( enemyPassive.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_PASSIVE_H_
#define _ENEMY_PASSIVE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 受け身 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyPassive : public EnemyState
{
public:
	EnemyPassive( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyPassive*	Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_blowPower;					//  吹っ飛び力
};

#endif

