//--------------------------------------------------------------------------------------
//  エネミーステート( ジャンプ )   ( enemyJump.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyJump.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------
static const float	ENEMY_GRAVITY = 0.1f;
static const int	ENEMY_ENABLE_NUM_JUMP = 2;

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyJump::Init( void )
{
	//  親の初期化
	EnemyState::Init( );

	//  メンバ変数の初期化
	m_countJump = 1;
	m_jumpPower = GetEnemy( )->GetJumpPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyJump::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyJump::Update( void )
{
	//  アクション
	Action( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyJump::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyJump::Action( void )
{
	//  シーンクラスのポインタ
	Scene* pScene = NULL;			

	////  ENEMY_ENABLE_NUM_JUMP( 2 )段ジャンプ用処理
	//if( m_countJump < ENEMY_ENABLE_NUM_JUMP )
	//{
	//	//  ジャンプアニメーションに
	//	GetEnemy( )->SetAnimation( StateAnimator::MOTION_JUMP );

	//	//  ジャンプ力の初期化
	//	m_jumpPower = GetEnemy( )->GetJumpPower( );

	//	//  ジャンプカウント
	//	m_countJump++;
	//}

	//  座標の更新( 進行方向 × 速度 分の移動 )
	GetEnemy( )->MovePos( GetEnemy( )->GetVecDirect( ) * GetEnemy( )->GetSpeed( ) );

	//  注視点を向いている方向に
	GetEnemy( )->SetPositionAt( GetEnemy( )->GetPos( ) + GetEnemy( )->GetVecDirect( ) * 5.0f );

	//  ジャンプ力分上に上がるのとジャンプ力を重力分下げる
	GetEnemy( )->MoveHeight( m_jumpPower );
	m_jumpPower -= ENEMY_GRAVITY;

	//  地面についた場合
	if( GetEnemy( )->JudgeHitGround( ) )
	{
		//  着地アニメーションに
		GetEnemy( )->SetAnimation( StateAnimator::MOTION_LANDING_SHORT );
		GetEnemy( )->ChangeState( GetEnemy( )->GetEnemyState( Enemy::STATE::LANDING ) );
	}
}