//--------------------------------------------------------------------------------------
//  エネミーステート( ニュートラル )  ( enemyRauderIdle.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_RAUDER_IDLE_H_
#define _ENEMY_RAUDER_IDLE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyRauderState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class EnemyRauder;

//--------------------------------------------------------------------------------------
//  エネミーステート( ニュートラル ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyRauderIdle : public EnemyRauderState
{
public:
	EnemyRauderIdle( EnemyRauder* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;					//  初期化
	void					Uninit( void ) override;				//  終了
	void					Update( void ) override;				//  更新
	void					Draw( void ) override;					//  描画

private:
};

#endif

