//--------------------------------------------------------------------------------------
//  エネミーステート( 吹っ飛び )  ( enemyBlow.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_BLOW_H_
#define _ENEMY_BLOW_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 吹っ飛び ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyBlow : public EnemyState
{
public:
	EnemyBlow( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyBlow*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_blowPower;					//  吹っ飛びの力
};

#endif
