//--------------------------------------------------------------------------------------
//  プレイヤーステート( ジャンプ )   ( playerJump.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyRauderJump.h"
#include "enemyRauder.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------
static const float	PLAYER_GRAVITY = 0.1f;
static const int	PLAYER_ENABLE_NUM_JUMP = 2;

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyRauderJump::Init( void )
{
	//  親の初期化
	EnemyRauderState::Init( );

	//  メンバ変数の初期化
	m_countJump = 1;
	m_jumpPower = GetEnemy( )->GetJumpPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyRauderJump::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyRauderJump::Update( void )
{
	//  アクション
	Action( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyRauderJump::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyRauderJump::Action( void )
{
	//  シーンクラスのポインタ
	Scene* pScene = NULL;

	// キーボード情報の取得
	Keyboard* pKeyboard = SceneManager::GetKeyboard( );

	//  PS4コントローラー情報の取得
	PS4Controller* pPS4Input = SceneManager::GetPS4Input( );

	//  座標の更新( 進行方向 × 速度 分の移動 )
	GetEnemy( )->MovePos( GetEnemy( )->GetVecDirect( ) * GetEnemy( )->GetSpeed( ) );

	//  注視点を向いている方向に
	GetEnemy( )->SetPositionAt( GetEnemy( )->GetPos( ) + GetEnemy( )->GetVecDirect( ) * 5.0f );

	//  ジャンプ力分上に上がるのとジャンプ力を重力分下げる
	GetEnemy( )->MoveHeight( m_jumpPower );
	m_jumpPower -= PLAYER_GRAVITY;

	//  地面についた場合
	if( GetEnemy( )->JudgeHitGround( ) )
	{
		//  着地アニメーションに
		GetEnemy( )->SetMotion( FBXLoader::MOTION::IDLE );
		GetEnemy( )->ChangeState( GetEnemy( )->GetEnemyState( EnemyRauder::STATE::IDLE ) );
	}
}