//--------------------------------------------------------------------------------------
//  エネミーステート( やられ )  ( enemyBend.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_BEND_H_
#define _ENEMY_BEND_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( やられ ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyBend : public EnemyState
{
public:
	EnemyBend( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyBend*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション
};

#endif

