//--------------------------------------------------------------------------------------
//  エネミーステート( 回避 )   ( enemyEscape.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyEscape.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------
static const float	ENEMY_AVOID_SPEED	= 1.5f;
static const float	ENEMY_GRAVITY		= 0.1f;

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyEscape::Init( void )
{
	//  親の初期化
	EnemyState::Init( );

	//  回避時移動量の代入
	m_speed = ENEMY_AVOID_SPEED;

	//  ジャンプ力の代入
	m_jumpPower = GetEnemy( )->GetJumpPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyEscape::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyEscape::Update( void )
{
	//  アクション
	Action( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyEscape::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyEscape::Action( void )
{
	//  座標の更新( 進行方向 × 速度 分の移動 )
	GetEnemy( )->MovePos( GetEnemy( )->GetVecDirect( ) * m_speed * GetEnemy( )->GetMovePower( ) );

	//  移動量を下げていく
	m_speed += ( 0.0f - m_speed ) * 0.01f;

	//  ジャンプ力分上に上がるのとジャンプ力を重力分下げる
	GetEnemy( )->MoveHeight( m_jumpPower );
	m_jumpPower -= ENEMY_GRAVITY;

	//  注視点を向いている方向に
	GetEnemy( )->SetPositionAt( GetEnemy( )->GetPos( ) + GetEnemy( )->GetVecDirect( ) * 5.0f );

	//  無敵時間の代入
	GetEnemy( )->SetInvisibleTime( 2 );

	//  地面についた場合
	if( GetEnemy( )->JudgeHitGround( ) )
	{
		//  着地アニメーションに
		GetEnemy( )->SetAnimation( StateAnimator::MOTION_LANDING_LONG );

		//  状態の変更
		GetEnemy( )->ChangeState( GetEnemy( )->GetEnemyState( Enemy::STATE::LANDING ) );
	}
}