//--------------------------------------------------------------------------------------
//  エネミーステート( リザルト時の勝利 )  ( enemyResultWin.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_RESULT_WIN_H_
#define _ENEMY_RESULT_WIN_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( リザルト時の勝利 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyResultWin : public EnemyState
{
public:
	EnemyResultWin( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static EnemyResultWin*		Create( void );					//  生成

private:
};

#endif
