//--------------------------------------------------------------------------------------
//  エネミーステート( 防御 )   ( enemyGuard.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyGuard.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyGuard::Init( void )
{
	//  親の初期化
	EnemyState::Init( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyGuard::Uninit( void )
{
	//  防御解除状態に
	GetEnemy( )->SetGuardFlag( false );
}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyGuard::Update( void )
{
	//  アクション
	Action( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyGuard::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyGuard::Action( void )
{
	//  キーが1か2の場合
	if( GetEnemy( )->GetAnimationKey( ) <= 2 )
	{
		//  防御状態に
		GetEnemy( )->SetGuardFlag( true );
	}
	else
	{
		//  防御解除状態に
		GetEnemy( )->SetGuardFlag( false );
	}

	//  アニメーションが終了している場合
	if( GetEnemy( )->GetAnimationFinish( ) )
	{
		//  モーションの変更
		GetEnemy( )->SetAnimation( StateAnimator::MOTION_NEUTRAL );

		//  状態の変更
		GetEnemy( )->ChangeState( GetEnemy( )->GetEnemyState( Enemy::STATE::NEUTRAL ) );

		//  エフェクシアの再生ストップ
		EffekseerManager::Stop( GetEnemy( )->GetEffekseerHandle( EffekseerManager::TYPE_SHIELD ) );
	}
}