//--------------------------------------------------------------------------------------
//  エネミーステート( 回避 )  ( enemyEscape.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_ESCAPE_H_
#define _ENEMY_ESCAPE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 回避 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyEscape : public EnemyState
{
public:
	EnemyEscape( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyEscape*	Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_speed;						//  速度
	float					m_jumpPower;					//  ジャンプ力
};

#endif
