//--------------------------------------------------------------------------------------
//  エネミーステート( 受け身 )   ( enemyPassive.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyPassive.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyPassive::Init( void )
{
	//  親の初期化
	EnemyState::Init( );

	//  吹っ飛び力の取得
	m_blowPower = GetEnemy( )->GetBlowPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyPassive::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyPassive::Update( void )
{
	//  アクション
	Action( );

	//  重力をかける
	AddGravity( );

	//  ニュートラル状態に変更するかの判断
	JudgeChangeNeutral( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyPassive::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyPassive::Action( void )
{
	//  無敵時間の設定
	GetEnemy( )->SetInvisibleTime( 21 );

	//  速度の減衰
	m_blowPower += ( 0.0f - m_blowPower ) * 0.04f;

	//  吹っ飛び力分の移動
	GetEnemy( )->MovePos( GetEnemy( )->GetBlowVecDirect( ) * m_blowPower );

	//  エネミー方向ベクトルの設定
	D3DXVECTOR3 enemyVecDirect;
	D3DXVec3Normalize( &enemyVecDirect , &( GetEnemy( )->GetPositionAt( ) - GetEnemy( )->GetPos( ) ) );
	GetEnemy( )->SetVecDirect( enemyVecDirect );

	//  注視点の設定
	GetEnemy( )->SetPositionAt( GetEnemy( )->GetPos( ) - GetEnemy( )->GetBlowVecDirect( ) * 5.0f );
}