//--------------------------------------------------------------------------------------
//  エネミーステート( 突進攻撃 )  ( enemyRushAttack.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_RUSH_ATTACK_H_
#define _ENEMY_RUSH_ATTACK_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 突進攻撃 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyRushAttack : public EnemyState
{
public:
	EnemyRushAttack( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static EnemyRushAttack*		Create( void );					//  生成

private:
	void						Action( void );					//  アクション

	float						m_speed;
};

#endif
