//--------------------------------------------------------------------------------------
//  エネミーステート( フリーダッシュ )  ( enemyFreeDash.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_FREE_DASH_H_
#define _ENEMY_FREE_DASH_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( フリーダッシュ ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyFreeDash : public EnemyState
{
public:
	EnemyFreeDash( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static EnemyFreeDash*		Create( void );					//  生成

private:
	void						Action( void );					//  アクション

	float						m_speed;
};

#endif
