//--------------------------------------------------------------------------------------
//  エネミーステート( 着地 )  ( enemyLanding.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_LANDING_H_
#define _ENEMY_LANDING_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 着地 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyLanding : public EnemyState
{
public:
	enum class RIGID_TIME												//  硬直時間
	{
		SHORT = 0 ,														//  短い
		LONG ,															//  長い
	};

	EnemyLanding( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;						//  初期化
	void					Uninit( void ) override;					//  終了
	void					Update( void ) override;					//  更新
	void					Draw( void ) override;						//  描画

	static EnemyLanding*	Create( void );								//  生成
																		
private:					
	void					Action( void );								//  アクション
																		
	RIGID_TIME				m_rigidTimeType;							//  硬直時間の種類
};

#endif
