//--------------------------------------------------------------------------------------
//  エネミーステート( フリーダッシュ )   ( enemyFreeDash.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyFreeDash.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"
#include "particle.h"
#include "enemy.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------
static const float ENEMY_LOCKON_DASH_SPEED = 2.5f;

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyFreeDash::Init( void )
{
	//  親の初期化
	EnemyState::Init( );

	//  速度の初期化
	m_speed = ENEMY_LOCKON_DASH_SPEED;
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyFreeDash::Uninit( void )
{
	m_speed = 0.0f;
}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyFreeDash::Update( void )
{
	//  速度がある一定を下回った場合
	if( m_speed <= 0.9f )
	{
		//  ニュートラル状態に変更するかの判断
		JudgeChangeNeutral( );
	}
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyFreeDash::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyFreeDash::Action( void )
{
	D3DXVECTOR3 workVecDirect( 0.0f , 0.0f , 0.0f );

	//  現在の方向ベクトル
	D3DXVECTOR3 currentVecDirect = GetEnemy( )->GetVecDirect( );

	//  現在の方向ベクトルを入力方向ベクトルに徐々に近づける
	currentVecDirect += ( workVecDirect - currentVecDirect ) * 0.05f;

	//  敵からエネミーまでの方向ベクトルを求める
	D3DXVec3Normalize( &currentVecDirect , &currentVecDirect );
	GetEnemy( )->SetVecDirect( currentVecDirect );

	//  座標の更新( 進行方向 × 速度 分の移動 )
	GetEnemy( )->MovePos( GetEnemy( )->GetVecDirect( ) * m_speed );

	//  注視点を向いている方向に
	GetEnemy( )->SetPositionAt( GetEnemy( )->GetPos( ) + GetEnemy( )->GetVecDirect( ) * 5.0f );

	//  速度を徐々に減衰させていく
	m_speed += ( 0.0f - m_speed ) * 0.03f;

	//  パーティクルの生成
	Particle::Create( Particle::TYPE_NORMAL , GetEnemy( )->GetPos( ) , D3DXVECTOR3( 1.0f , 0.0f , 1.0f ) ,
					  D3DXCOLOR( 0.2f , 0.5f , 0.8f , 1.0f ) , 4.0f , 0.1f , 0.01f , 0.0f , 0.0f , 20 );
}