//--------------------------------------------------------------------------------------
//  エネミーステート( 防御 )  ( enemyGuard.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_GUARD_H_
#define _ENEMY_GUARD_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 防御 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyGuard : public EnemyState
{
public:
	EnemyGuard( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyGuard*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション
};

#endif
