//--------------------------------------------------------------------------------------
//  エネミーステート( ジャンプ )  ( enemyRauderJump.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_RAUDER_JUMP_H_
#define _ENEMY_RAUDER_JUMP_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyRauderState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class EnemyRauder;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ジャンプ ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyRauderJump : public EnemyRauderState
{
public:
	EnemyRauderJump( EnemyRauder* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

private:
	void					Action( void );					//  アクション

	float					m_jumpPower;					//  ジャンプ力
	int						m_countJump;					//  ジャンプ数
};

#endif
