//--------------------------------------------------------------------------------------
//  エネミーステート( 移動 )  ( enemyMove.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _ENEMY_MOVE_H_
#define _ENEMY_MOVE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Enemy;

//--------------------------------------------------------------------------------------
//  エネミーステート( 移動 ) クラスの定義
//--------------------------------------------------------------------------------------
class EnemyMove : public EnemyState
{
public:
	EnemyMove( Enemy* enemy )
	{
		SetEnemy( enemy );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static EnemyMove*		Create( void );					//  生成

private:
	/*--------------  
	    判断処理
	 -------------*/
	void					Action( void );					//  アクション
};

#endif
