//--------------------------------------------------------------------------------------
//  エネミーステート( 魔法準備 )   ( enemyMagicReady.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "enemyMagicReady.h"
#include "enemy.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"
#include "magic.h"
#include "magicFire.h"
#include "magicLightning.h"
#include "magicTornade.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void EnemyMagicReady::Init( void )
{
	//  親の初期化
	EnemyState::Init( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void EnemyMagicReady::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void EnemyMagicReady::Update( void )
{
	//  アクション
	Action( );

	//  重力をかける
	AddGravity( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void EnemyMagicReady::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void EnemyMagicReady::Action( void )
{
	Magic* magic = GetEnemy( )->GetMagic( );

	if( magic != NULL )
	{
		Enemy::MAGIC magicType = GetEnemy( )->GetMagicType( );

		//  雷魔法を持っている場合
		if( magicType == Enemy::MAGIC::LIGHTNING )
		{
			//  魔法陣を動かす
			MagicLightning* pMagicLightning = ( MagicLightning* )GetEnemy( )->GetMagic( );
			pMagicLightning->MoveMagicPos( GetEnemy( )->GetVecDirect( ) );
		}	

		//  竜巻魔法を持っている倍
		if( magicType == Enemy::MAGIC::TORNADE )
		{
			//  移動方向ベクトルの設定
			MagicTornade* pMagicToranade = ( MagicTornade* )GetEnemy( )->GetMagic( );

			pMagicToranade->SetMoveVecDirect( GetEnemy( )->GetVecDirect( ) );
		}
	}
}