//--------------------------------------------------------------------------------------
//  入力処理  ( input.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _INPUT_H_
#define _INPUT_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "main.h"

//--------------------------------------------------------------------------------------
//  入力クラスの定義
//--------------------------------------------------------------------------------------
class Input
{
public:
	Input( );													//  コンストラクタ
	~Input( );													//  デストラクタ

	HRESULT					Init( HINSTANCE hInstance ,			//  初期化
								  HWND hWnd );
	void					Uninit( void );						//  終了
	void					Update( void );						//  更新

protected:
	static LPDIRECTINPUT8	m_pInput;							// DirectInputオブジェクトへのポインタ
};

#endif

