//--------------------------------------------------------------------------------------
//  魔法  ( magic.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _MAGIC_H_
#define _MAGIC_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "main.h"
#include "scene.h"

//--------------------------------------------------------------------------------------
//  魔法クラスの定義
//--------------------------------------------------------------------------------------
class Magic : public Scene
{
public:
	typedef enum
	{
		OWNER_NONE = 0 ,
		OWNER_PLAYER ,
		OWNER_PLAYER2 ,
		OWNER_PLAYER3 ,
		OWNER_PLAYER4 ,
		OWNER_ENEMY ,
	} OWNER;

	Magic( ){ }										//  コンストラクタ
	~Magic( ){ }										//  デストラクタ

	virtual void		SetActive( void ) = 0;			//  アクティブ状態に
	virtual void		Delete( void ) = 0;

protected:
	OWNER				m_owner;						//  所有者
	bool				m_bActive;						//	実行するかどうか

private:
};

#endif

