//--------------------------------------------------------------------------------------
//  プレイヤーステート( 吹っ飛び )  ( playerBlow.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_BLOW_H_
#define _PLAYER_BLOW_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 吹っ飛び ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerBlow : public PlayerState
{
public:
	PlayerBlow( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static PlayerBlow*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_blowPower;					//  吹っ飛びの力
};

#endif
