//--------------------------------------------------------------------------------------
//  プレイヤーステート( 受け身 )  ( playerPassive.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_PASSIVE_H_
#define _PLAYER_PASSIVE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 受け身 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerPassive : public PlayerState
{
public:
	PlayerPassive( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static PlayerPassive*	Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_blowPower;					//  吹っ飛び力
};

#endif

