//--------------------------------------------------------------------------------------
//  プレイヤーステート( HP攻撃 )  ( playerWinksHPAttack.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_WINKS_HP_ATTACK_H_
#define _PLAYER_WINKS_HP_ATTACK_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerWinksState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class PlayerWinks;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( HP攻撃 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerWinksHPAttack : public PlayerWinksState
{
public:
	PlayerWinksHPAttack( PlayerWinks* player )
	{
		SetPlayer( player );
	};

	void							Init( void ) override;			//  初期化
	void							Uninit( void ) override;		//  終了
	void							Update( void ) override;		//  更新
	void							Draw( void ) override;			//  描画

private:
	void							Action( void );					//  アクション

	bool							m_slashEffekseer;				//  スラッシュエフェクシアが出たかのフラグ
};

#endif
