//--------------------------------------------------------------------------------------
//  プレイヤーステート( 着地 )  ( playerLanding.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_LANDING_H_
#define _PLAYER_LANDING_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 着地 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerLanding : public PlayerState
{
public:
	enum class RIGID_TIME												//  硬直時間
	{
		SHORT = 0 ,														//  短い
		LONG ,															//  長い
	};

	PlayerLanding( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;						//  初期化
	void					Uninit( void ) override;					//  終了
	void					Update( void ) override;					//  更新
	void					Draw( void ) override;						//  描画

	static PlayerLanding*	Create( void );								//  生成
																		
private:					
	void					Action( void );								//  アクション
																		
	RIGID_TIME				m_rigidTimeType;							//  硬直時間の種類
};

#endif
