//--------------------------------------------------------------------------------------
//  プレイヤーステート( ブレイブ攻撃000 )  ( playerHPAttack000.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_HP_ATTACK000_H_
#define _PLAYER_HP_ATTACK000_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ブレイブ攻撃000 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerHPAttack000 : public PlayerState
{
public:
	PlayerHPAttack000( Player* player )
	{
		SetPlayer( player );
	};

	void							Init( void ) override;			//  初期化
	void							Uninit( void ) override;		//  終了
	void							Update( void ) override;		//  更新
	void							Draw( void ) override;			//  描画

	static PlayerHPAttack000*		Create( void );					//  生成

private:
	void							Action( void );					//  アクション

	bool							m_slashEffekseer;				//  スラッシュエフェクシアが出たかのフラグ
};

#endif
