//--------------------------------------------------------------------------------------
//  プレイヤーステート( ニュートラル )  ( playerWinksIdle.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_WINKS_IDLE_H_
#define _PLAYER_WINKS_IDLE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerWinksState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ニュートラル ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerWinksIdle : public PlayerWinksState
{
public:
	PlayerWinksIdle( PlayerWinks* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;					//  初期化
	void					Uninit( void ) override;				//  終了
	void					Update( void ) override;				//  更新
	void					Draw( void ) override;					//  描画

private:
};

#endif

