//--------------------------------------------------------------------------------------
//  プレイヤーステート( 回避 )  ( playerEscape.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_ESCAPE_H_
#define _PLAYER_ESCAPE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 回避 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerEscape : public PlayerState
{
public:
	PlayerEscape( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static PlayerEscape*	Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_speed;						//  速度
	float					m_jumpPower;					//  ジャンプ力
};

#endif
