//--------------------------------------------------------------------------------------
//  プレイヤーステート( ニュートラル )  ( playerRauderIdle.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_RAUDER_IDLE_H_
#define _PLAYER_RAUDER_IDLE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerRauderState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ニュートラル ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerRauderIdle : public PlayerRauderState
{
public:
	PlayerRauderIdle( PlayerRauder* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;					//  初期化
	void					Uninit( void ) override;				//  終了
	void					Update( void ) override;				//  更新
	void					Draw( void ) override;					//  描画

private:
};

#endif

