//--------------------------------------------------------------------------------------
//  プレイヤーステート( 魔法準備 )  ( playerMagicReady.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_MAGIC_READY_H_
#define _PLAYER_MAGIC_READY_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 魔法準備 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerMagicReady : public PlayerState
{
public:
	PlayerMagicReady( Player* player )
	{
		SetPlayer( player );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static PlayerMagicReady*	Create( void );					//  生成

private:
	void						Action( void );					//  アクション
};

#endif
