//--------------------------------------------------------------------------------------
//  プレイヤーステート( 待機 )   ( playerWinksIdle.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerWinksIdle.h"
#include "playerWinks.h"
#include "manager.h"
#include "keyboard.h"
#include "joystick.h"
#include "game.h"
#include "camera.h"
#include "effekseerManager.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void PlayerWinksIdle::Init( void )
{
	//  親の初期化
	PlayerWinksState::Init( );

	//  待機モーションに変更
	GetPlayer( )->SetMotion( FBXLoader::MOTION::IDLE );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void PlayerWinksIdle::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void PlayerWinksIdle::Update( void )
{
	//  カメラ制御
	ControlCamera( );

	//  重力をかける
	AddGravity( );

	//  移動状態に変更するかの判定
	JudgeChangeMove( );

	//  ジャンプ状態に変更するかの判定
	JudgeChangeJump( );

	//  攻撃状態に変更するかの判定
	JudgeChangeAttack( );

	//  HP攻撃状態に変更するかの判定
	JudgeChangeHPAttack( );

	//  ダッシュ状態に変更するかの判定
	JudgeChangeDash( );

	//  ガード状態に変更するかの判定
	JudgeChangeGuard( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void PlayerWinksIdle::Draw( void )
{

}