//--------------------------------------------------------------------------------------
//  プレイヤーステート( 防御 )  ( playerGuard.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_GUARD_H_
#define _PLAYER_GUARD_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 防御 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerGuard : public PlayerState
{
public:
	PlayerGuard( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static PlayerGuard*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション
};

#endif
