//--------------------------------------------------------------------------------------
//  プレイヤーステート( ニュートラル )  ( playerNeutral.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_NEUTRAL_H_
#define _PLAYER_NEUTRAL_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ニュートラル ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerNeutral : public PlayerState
{
public:
	PlayerNeutral( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;					//  初期化
	void					Uninit( void ) override;				//  終了
	void					Update( void ) override;				//  更新
	void					Draw( void ) override;					//  描画

	static PlayerNeutral*	Create( void );							//  生成

private:
};

#endif

