//--------------------------------------------------------------------------------------
//  プレイヤーステート( 移動 )  ( playerRauderMove.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_RAUDER_MOVE_H_
#define _PLAYER_RAUDER_MOVE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerRauderState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class PlayerRauder;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 移動 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerRauderMove : public PlayerRauderState
{
public:
	PlayerRauderMove( PlayerRauder* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

private:
	void					Action( void );					//  アクション
};

#endif
