//--------------------------------------------------------------------------------------
//  プレイヤーステート( 魔法発動 )  ( playerMagicActive.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_MAGIC_ACTIVE_H_
#define _PLAYER_MAGIC_ACTIVE_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( 魔法発動 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerMagicActive : public PlayerState
{
public:
	PlayerMagicActive( Player* player )
	{
		SetPlayer( player );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static PlayerMagicActive*	Create( void );					//  生成

private:
};

#endif
