//--------------------------------------------------------------------------------------
//  プレイヤーステート( 受け身 )   ( playerPassive.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerPassive.h"
#include "player.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void PlayerPassive::Init( void )
{
	//  親の初期化
	PlayerState::Init( );

	//  吹っ飛び力の取得
	m_blowPower = GetPlayer( )->GetBlowPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void PlayerPassive::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void PlayerPassive::Update( void )
{
	//  カメラ制御
	ControlCamera( );

	//  アクション
	Action( );

	//  重力をかける
	AddGravity( );

	//  ニュートラル状態に変更するかの判断
	JudgeChangeNeutral( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void PlayerPassive::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void PlayerPassive::Action( void )
{
	//  無敵時間の設定
	GetPlayer( )->SetInvisibleTime( 21 );

	//  速度の減衰
	m_blowPower += ( 0.0f - m_blowPower ) * 0.04f;

	//  吹っ飛び力分の移動
	GetPlayer( )->MovePos( GetPlayer( )->GetBlowVecDirect( ) * m_blowPower );

	//  プレイヤー方向ベクトルの設定
	D3DXVECTOR3 playerVecDirect;
	D3DXVec3Normalize( &playerVecDirect , &( GetPlayer( )->GetPositionAt( ) - GetPlayer( )->GetPos( ) ) );
	GetPlayer( )->SetVecDirect( playerVecDirect );

	//  注視点の設定
	GetPlayer( )->SetPositionAt( GetPlayer( )->GetPos( ) - GetPlayer( )->GetBlowVecDirect( ) * 5.0f );
}