//--------------------------------------------------------------------------------------
//  プレイヤーステート( 回避 )   ( playerEscape.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerEscape.h"
#include "player.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------
static const float	PLAYER_AVOID_SPEED	= 1.5f;
static const float	PLAYER_GRAVITY		= 0.1f;

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void PlayerEscape::Init( void )
{
	//  親の初期化
	PlayerState::Init( );

	//  回避時移動量の代入
	m_speed = PLAYER_AVOID_SPEED;

	//  ジャンプ力の代入
	m_jumpPower = GetPlayer( )->GetJumpPower( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void PlayerEscape::Uninit( void )
{

}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void PlayerEscape::Update( void )
{
	//  カメラ制御
	ControlCamera( );

	//  アクション
	Action( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void PlayerEscape::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void PlayerEscape::Action( void )
{
	//  座標の更新( 進行方向 × 速度 分の移動 )
	GetPlayer( )->MovePos( GetPlayer( )->GetVecDirect( ) * m_speed * GetPlayer( )->GetMovePower( ) );

	//  移動量を下げていく
	m_speed += ( 0.0f - m_speed ) * 0.01f;

	//  ジャンプ力分上に上がるのとジャンプ力を重力分下げる
	GetPlayer( )->MoveHeight( m_jumpPower );
	m_jumpPower -= PLAYER_GRAVITY;

	//  注視点を向いている方向に
	GetPlayer( )->SetPositionAt( GetPlayer( )->GetPos( ) + GetPlayer( )->GetVecDirect( ) * 5.0f );

	//  無敵時間の代入
	GetPlayer( )->SetInvisibleTime( 2 );

	//  地面についた場合
	if( GetPlayer( )->JudgeHitGround( ) )
	{
		//  着地アニメーションに
		GetPlayer( )->SetAnimation( StateAnimator::MOTION_LANDING_LONG );

		//  状態の変更
		GetPlayer( )->ChangeState( GetPlayer( )->GetPlayerState( Player::STATE::LANDING ) );
	}
}