//--------------------------------------------------------------------------------------
//  プレイヤーステート( リザルト時の勝利 )  ( playerResultWin.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_RESULT_WIN_H_
#define _PLAYER_RESULT_WIN_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( リザルト時の勝利 ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerResultWin : public PlayerState
{
public:
	PlayerResultWin( Player* player )
	{
		SetPlayer( player );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static PlayerResultWin*		Create( void );					//  生成

private:
};

#endif
