//--------------------------------------------------------------------------------------
//  プレイヤーステート( ジャンプ )  ( playerJump.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_JUMP_H_
#define _PLAYER_JUMP_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ジャンプ ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerJump : public PlayerState
{
public:
	PlayerJump( Player* player )
	{
		SetPlayer( player );
	};

	void					Init( void ) override;			//  初期化
	void					Uninit( void ) override;		//  終了
	void					Update( void ) override;		//  更新
	void					Draw( void ) override;			//  描画

	static PlayerJump*		Create( void );					//  生成

private:
	void					Action( void );					//  アクション

	float					m_jumpPower;					//  ジャンプ力
	int						m_countJump;					//  ジャンプ数
};

#endif
