//--------------------------------------------------------------------------------------
//  プレイヤーステート( 防御 )   ( playerGuard.cpp )
//
//  Author : SHUN YAMASHITA
//
//  Update : 2017/11/25
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerGuard.h"
#include "player.h"
#include "game.h"
#include "manager.h"
#include "camera.h"
#include "joystick.h"
#include "keyboard.h"

//--------------------------------------------------------------------------------------
//  マクロ定義
//--------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------
//  初期化処理をする関数
//--------------------------------------------------------------------------------------
void PlayerGuard::Init( void )
{
	//  親の初期化
	PlayerState::Init( );
}

//--------------------------------------------------------------------------------------
//  終了処理をする関数
//--------------------------------------------------------------------------------------
void PlayerGuard::Uninit( void )
{
	//  防御解除状態に
	GetPlayer( )->SetGuardFlag( false );
}

//--------------------------------------------------------------------------------------
//  更新処理をする関数
//--------------------------------------------------------------------------------------
void PlayerGuard::Update( void )
{
	//  カメラ制御
	ControlCamera( );

	//  アクション
	Action( );
}

//--------------------------------------------------------------------------------------
//  描画処理をする関数
//--------------------------------------------------------------------------------------
void PlayerGuard::Draw( void )
{

}

//--------------------------------------------------------------------------------------
//  アクションをする関数
//--------------------------------------------------------------------------------------
void PlayerGuard::Action( void )
{
	//  キーが1か2の場合
	if( GetPlayer( )->GetAnimationKey( ) <= 2 )
	{
		//  防御状態に
		GetPlayer( )->SetGuardFlag( true );
	}
	else
	{
		//  防御解除状態に
		GetPlayer( )->SetGuardFlag( false );
	}

	//  アニメーションが終了している場合
	if( GetPlayer( )->GetAnimationFinish( ) )
	{
		//  モーションの変更
		GetPlayer( )->SetAnimation( StateAnimator::MOTION_NEUTRAL );

		//  状態の変更
		GetPlayer( )->ChangeState( GetPlayer( )->GetPlayerState( Player::STATE::NEUTRAL ) );

		//  エフェクシアの再生ストップ
		EffekseerManager::Stop( GetPlayer( )->GetEffekseerHandle( EffekseerManager::TYPE_SHIELD ) );
	}
}