//--------------------------------------------------------------------------------------
//  プレイヤーステート( ロックオンダッシュ )  ( playerLockonDash.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_LOCKON_DASH_H_
#define _PLAYER_LOCKON_DASH_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( ロックオンダッシュ ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerLockonDash : public PlayerState
{
public:
	PlayerLockonDash( Player* player )
	{
		SetPlayer( player );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

private:
	void						Action( void );					//  アクション

	float						m_speed;
};

#endif
