//--------------------------------------------------------------------------------------
//  プレイヤーステート( フリーダッシュ )  ( playerFreeDash.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _PLAYER_FREE_DASH_H_
#define _PLAYER_FREE_DASH_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include "playerState.h"

//--------------------------------------------------------------------------------------
//  クラスの前方宣言
//--------------------------------------------------------------------------------------
class Player;

//--------------------------------------------------------------------------------------
//  プレイヤーステート( フリーダッシュ ) クラスの定義
//--------------------------------------------------------------------------------------
class PlayerFreeDash : public PlayerState
{
public:
	PlayerFreeDash( Player* player )
	{
		SetPlayer( player );
	};

	void						Init( void ) override;			//  初期化
	void						Uninit( void ) override;		//  終了
	void						Update( void ) override;		//  更新
	void						Draw( void ) override;			//  描画

	static PlayerFreeDash*		Create( void );					//  生成

private:
	void						Action( void );					//  アクション

	float						m_speed;
};

#endif
