//--------------------------------------------------------------------------------------
//  ランダムレイヤーAIクラス   ( randomLayerAI.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _RANDOM_LAYER_AI_H_
#define _RANDOM_LAYER_AI_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include <list>
#include <string>
#include "characterAI.h"
#include "layerAI.h"

//--------------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------------
class NodeAI;

//--------------------------------------------------------------------------------------
//  ランダムレイヤーAIクラスの定義
//--------------------------------------------------------------------------------------
class RandomLayerAI : public LayerAI
{
public:
	RandomLayerAI( std::string name ,							//  引数付きコンストラクタ
				   CharacterAI* characterAI ,
				   NodeAI* parentNode ) :
				   LayerAI( CharacterAI::LAYER_TYPE::RANDOM ,
							name ,
							characterAI ,
							parentNode ){ }	  

	void			Run( void ) override;						//  実行	

private:

};

#endif
