//--------------------------------------------------------------------------------------
//  シークエンスレイヤーAIクラス   ( sequenceLayerAI.h )
//
//  Author : SHUN YAMASHITA
//--------------------------------------------------------------------------------------
#ifndef _SEQUENCE_LAYER_AI_H_
#define _SEQUENCE_LAYER_AI_H_

//--------------------------------------------------------------------------------------
//  ヘッダーファイル
//--------------------------------------------------------------------------------------
#include <list>
#include <string>
#include "characterAI.h"
#include "layerAI.h"

//--------------------------------------------------------------------------------------
//  前方宣言
//--------------------------------------------------------------------------------------
class NodeAI;

//--------------------------------------------------------------------------------------
//  シークエンスレイヤーAIクラスの定義
//--------------------------------------------------------------------------------------
class SequenceLayerAI : public LayerAI
{
public:
	SequenceLayerAI( std::string name ,								//  引数付きコンストラクタ
					 CharacterAI* characterAI ,
					 NodeAI* parentNode ) :
					 LayerAI( CharacterAI::LAYER_TYPE::SEQUENCE ,
							  name ,
							  characterAI ,
							  parentNode ){ }	  

	void			Run( void ) override;							//  実行	

private:

};

#endif
